Revit 2021.1 API
UnitFormatUtils Members
Methods
Name | Description
Format(Units, ForgeTypeId, Double, Boolean)
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean) |  Obsolete.
 Formats a number with units into a string.
Format(Units, ForgeTypeId, Double, Boolean, FormatValueOptions)
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean, FormatValueOptions) |  Obsolete.
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean, Boolean) |  Obsolete.
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean, Boolean, FormatValueOptions) |  Obsolete.
 Formats a number with units into a string.
TryParse(Units, ForgeTypeId, String, Double)
 Parses a formatted string into a number with units if possible.
TryParse(Units, UnitType, String, Double) |  Obsolete.
 Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double)
 Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, Double, String)
 Parses a formatted string into a number with units if possible.
TryParse(Units, UnitType, String, ValueParsingOptions, Double) |  Obsolete.
 Parses a formatted string into a number with units if possible.
TryParse(Units, UnitType, String, Double, String) |  Obsolete.
 Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double, String)
 Parses a formatted string into a number with units if possible.
TryParse(Units, UnitType, String, ValueParsingOptions, Double, String) |  Obsolete.
 Parses a formatted string into a number with units if possible.
See Also
UnitFormatUtils Class
Autodesk.Revit.DB Namespace